[  
  {  
    "title": "Top U.N. Official Cindy McCain Says Northern Gaza Is Now In 'Full-Blown Famine'",  
    "content": "WASHINGTON (AP) — A top U.N. official said Friday that hard-hit northern Gaza was now in “full-blown famine” after more than six months of war between Israel and Hamas and severe Israeli restrictions on food deliveries to the Palestinian territory.\n\n Cindy McCain, the American director of the U.N. World Food Program, became the most prominent international official so far to declare that trapped civilians in the most cut-off part of Gaza had gone over the brink into famine.\n\n “It’s horror,” McCain told NBC’s “Meet the Press” in an interview to air Sunday. “There is famine — full-blown famine — in the north, and it’s moving its way south.”\n\n She said a cease-fire and a greatly increased flow of aid through land and sea routes was essential to confronting the growing humanitarian catastrophe in Gaza, home to 2.3 million people.\n\n There was no immediate comment from Israel, which controls entrance into Gaza and says it is beginning to allow in more food and other humanitarian aid through land crossings.\n\n The panel that serves as the internationally recognized monitor for food crises said in March that northern Gaza was on the brink of famine and likely to experience it in May. Since March, northern Gaza had not received anything like the aid needed to stave off famine, a U.S. Agency for International Development humanitarian official for Gaza told The Associated Press. The panel’s next update will not come before this summer.",
    "time": "2023-09-17 14:32",
    "source": "from TheOnion"
  },  
  {  
    "title": "'Overcapacity' claims denied by regulator",  
    "content": "Efforts by certain countries to adopt the pretext of 'overcapacity' to implement trade protectionism pose a significant threat to global trade and economic growth, according to China's top economic regulator.\n\n n an article published on its official WeChat account on Friday, the National Development and Reform Commission said that China's exports of electric vehicles, lithium batteries, photovoltaic products and other items enrich the global supply chain and alleviate global inflationary pressure, making notable contributions to efforts worldwide in addressing climate change and promoting green transition.\n\n For some time now, officials and media in some countries have been accusing China of 'overcapacity' related to its new energy products, laying the groundwork for unilateralism and the enforcement of protectionist policies, said the article.\n\n However, when examined from the perspective of the international division of labor, global supply and demand, and tried-and-true market principles, the alleged 'overcapacity' in China's new energy sector appears to be nothing more than a meticulously constructed ploy by some countries, it said.\n\n The NDRC stressed this strategy aims to justify imposing trade protection measures. The consequences of such actions not only fail to benefit the accusing parties themselves, but also disrupt the stability and efficiency of global industrial and supply chains. They inflict damage on global economic and trade growth while impeding progress toward green transformation worldwide.\n\n Experts said that enforcing protectionist measures under the pretext of addressing alleged 'overcapacity' restricts market competition and shields outdated production capabilities. This threatens global industrial progress.\n\n Countries such as the United States are intensifying limitations on China's exports of high-quality goods under the banner of 'overcapacity'. This approach serves as a safeguard for their own outdated production capabilities, achieved through non-market methods, said Li Wei, a researcher specializing in industrial economy at the Shanghai Academy of Social Sciences.\n\n The high market share of Chinese new energy vehicles in the European market is also partly attributable to US and European companies manufacturing vehicles in China, said Ji Xuehong, a professor at the School of Economics and Management at Beijing-based North China University of Technology.\n\n Ji said that their overseas expansion benefits from China's well-developed supply chain and the business decisions of their headquarters. This does not point to a scenario in which Chinese automakers monopolize the European market.\n\n The price advantage of Chinese new energy vehicles does not only not distort the market, but also provides a practical solution for Europe to achieve its energy transition goals, he added.\n\n China's auto sales rose 10.6 percent year-on-year to 6.72 million units in the first quarter, said the Beijing-based China Association of Automobile Manufacturers.\n\n In the meantime, the country's auto exports rose 33.2 percent year-on-year to over 1.32 million units.\n\n",  
    "time": "2023-08-05 07:45",
    "source":"from HuffPost"
  },  
  {  
    "title": "Taylor Swift Begins Day By Playing Video Reminding Travis Kelce Who She Is, How Long They’ve Dated",  
    "content": "LEAWOOD, KS—Urging her boyfriend to calm down after he woke up and immediately began to panic, Taylor Swift reportedly began her day Friday by playing a video reminding Travis Kelce who she is and how long they’ve dated. “Hi baby, I know you don’t know who I am right now, but my name is Taylor, and I love you very much,” said Swift, who, for the 200th time since the two started dating, played a 30-minute video that explained who the Kansas City Chiefs tight end was, how he woke up in a mansion, and why he was lying in bed with one of the world’s most famous singer-songwriters. “See, that’s you as a baby. And that’s you on the Kansas City Chiefs, with all your friends like Patrick Mahomes and Andy Reid. And that’s me. You thought I was pretty, so you gave me a friendship bracelet with your phone number on it. Now you’re dating a 14-time Grammy winner slash billionaire. To be honest, I don’t know how you pulled it off either!” At press time, sources confirmed Swift was gently reminding Travis Kelce that none of her former romantic partners mattered, firstly because she was over them, but secondly because he wouldn’t remember any of this in the morning.",  
    "time": "2023-11-22 19:10",
    "source":"from TheOnion"
  },  
  {  
    "title": "Economy Shows Unexpected Growth",  
    "content": "In a surprising turn of events, the economy has shown an unexpected growth of 3.2% in the last quarter. Analysts attribute this growth to increased consumer spending and a surge in exports. The government has expressed optimism about the sustained growth trend, while cautioning against complacency in the face of global economic uncertainties.",  
    "time": "2023-06-13 12:05",
    "source":"from TheOnion"  
  },  
  {  
    "title": "Political Unrest Sparks Concern",  
    "content": "The recent political unrest in the country has sparked concern among both citizens and the international community. Protests have been ongoing for several weeks, calling for political reforms and accountability. The government is facing pressure to address the grievances and find a peaceful resolution to the crisis.",  
    "time": "2023-12-09 11:20",
    "source":"from HuffPost"  
  },  
  {  
    "title": "Trump Watching Movie On iPad During Trial Without Using Headphones",  
    "content": "NEW YORK—Resting the device on his thighs behind the defendant’s table, former President Donald Trump reportedly watched a movie on an iPad during his trial Thursday, not bothering to use headphones. As witness Keith Davidson continued his testimony this morning, several reports indicated that people in the courtroom looked around in response to a sound that suddenly began emanating from a personal electronic device, with everyone eventually realizing the source was a high-octane action movie playing on the defendant’s iPad. According to court transcripts, Judge Juan Merchan repeatedly attempted to get Trump’s attention to ask him to turn off the 1994 Harrison Ford CIA thriller Clear And Present Danger, but the former commander-in-chief’s eyes remained locked on the screen, seemingly unbothered by the disturbance he was causing. Courtroom sources confirmed Trump lawyer Todd Blanche offered his client a pair of Hello Kitty Bluetooth headphones, but the former president declined, presumably not picking up on the hint. At press time, Trump had reportedly turned the volume of gemstones being crushed on a game of Bejeweled even higher in an attempt to drown out the judge’s disruptive gavel..",  
    "time": "2023-11-08 09:40",
    "source":"from HuffPost"    
  },  
  {  
    "title": "Cop Too Drunk To Administer Field Sobriety Test",  
    "content": "BELOIT, WI—After following a vehicle that had exited the parking lot of Hatley’s Pub and pulling it over on suspicion of drunk driving, local traffic cop Travis Hatcher was reportedly too intoxicated Thursday to administer a field sobriety test. “Hey there, Mr. Speed Racer Man…uh, do you know how fast I was—I mean you were—I mean…,” said the flush-faced and visibly confused police officer, who had stumbled his way to the vehicle and appeared to lose his train of thought while asking the driver if he could walk in a straight line from heel to toe. “Maybe you could do the backwards-letter thing? Or follow my eyes with your finger? Shit, I can’t even find the Breathalyzer. Do you have one?” At press time, reports confirmed Hatcher had accidentally shot and killed the drunk driver while trying to call in the traffic stop on his gun.",  
    "time": "2023-12-07 19:05",
    "source":"from HuffPost"    
  },  
  {  
    "title": "International Climate Change Summit Kicks Off",  
    "content": "World leaders and environmental experts have gathered for an international climate change summit, aiming to tackle the global challenge of climate change. The summit focuses on strategies for reducing greenhouse gas emissions, adapting to a changing climate, and mobilizing international cooperation. Participants are hopeful that the event will lead to meaningful actions and commitments from nations worldwide.",  
    "time": "2023-10-09 09:30",
    "source":"from TheOnion"    
  },  
  {  
    "title": "Best Practices For Policing Protests",  
    "content": "While police are well trained to shoot unarmed civilians, plant evidence, and file for overtime, dealing with larger-scale events like arresting several hundred college students can be more daunting. The following are the best practices law enforcement should follow when clearing political protests and demonstrations.",  
    "time": "2023-11-08 22:10",
    "source":"from HuffPost"    
  },  
  {  
    "title": "Can A Sexless Marriage Survive? We Asked The Experts.",  
    "content": "Sexless marriages, though rarely discussed openly, are more common than you might expect. \n\n But what exactly constitutes a sexless marriage? There’s no precise definition, though some experts say it’s when a couple has sex fewer than 10 times in one year. For San Francisco-based sex therapist and relationship coach Danielle Harel, it’s any marriage in which the sex is “mostly non-existent between the couple.” \n\n “It could be that they haven’t had sex in five years, or only have it every couple of months,” she told HuffPost.\n\n While a lack of sex may put a strain on many relationships, is it possible for some marriages to stay intact with little to no physical intimacy? We turned to sex experts to find out.",  
    "time": "2023-10-11 11:35",
    "source":"from HuffPost"    
  },  
  {  
    "title": "Orangutan Stuns Researchers By Using Rogaine To Fix Bald Spot",  
    "content": "ACEH, INDONESIA—Watching in awe as the wild animal applied the medicinal product to the top of his head, primate researchers were reportedly stunned Friday after witnessing an orangutan use Rogaine to fix a bald spot. “This is the first known case of any wild animal using an over-the-counter hair loss treatment product,” said evolutionary biologist Sophia Guskin, who was in the process of co-authoring a paper describing how the male Sumatran orangutan named Rakus was seen holding the can upside down, spraying the product onto his scalp, and using his fingers to massage the foam into the roots of his thinning red hair. “Rogaine contains minoxidil, a medication that many cultures believe can prevent or treat balding. Rakus was seen applying this product to the skin on his head not just once, but every day for several months, ultimately resulting in visibly thicker, fuller hair. We’re still not sure if the bald spot was a result of genetics from his mother’s side, father’s side, or stress, but nonetheless, we will continue to study this ape carefully.” At press time, Rakus was observed popping generic Viagra.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"    
  },  
  {  
    "title": "Nation Disappointed After Biden Answers Business Call During Big Recital",  
    "content": "WASHINGTON—His cell phone ringing and causing a huge distraction right as their piece began, the nation reported feeling embarrassed and devastated Friday after President Joe Biden answered a business call during their big recital. “We spent weeks practicing for the spring piano recital, and he missed our whole performance,” said a visibly disappointed Greg Holt, 56, who along with the rest of the American populace teared up as the president loudly barged out a gymnasium door to talk on his phone in the hallway, apparently not caring how hard the nation had worked to memorize all three pages of “Linus And Lucy.” “We kept looking for him in the audience, hoping he would return, but there was an empty seat next to the first lady the whole time. We know he’s a busy, important man, but our teacher scheduled this months ago! When he missed it last year, he said he’d watch a video taken by one of the other country’s presidents, though of course he never did. He’d better take us out for ice cream after, like he promised.” At press time, the piano recital was still in progress and sources confirmed Biden had returned just in time to hear Israel play.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Political Unrest Sparks Concern",  
    "content": "The recent political unrest in the country has sparked concern among both citizens and the international community. Protests have been ongoing for several weeks, calling for political reforms and accountability. The government is facing pressure to address the grievances and find a peaceful resolution to the crisis. The protests have brought to light several underlying issues, including corruption and inequality. International observers are closely monitoring the situation, hoping for a peaceful resolution and a return to stability. Meanwhile, the opposition is calling for early elections, claiming that the current government has lost its mandate to rule.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Tesla Lays Off Entire Team Behind Brakes",  
    "content": "AUSTIN, TX—In the latest round of layoffs for the company’s struggling automotive division, electric vehicle manufacturer Tesla fired the entire team behind brakes, sources confirmed Wednesday. “As we continue to rightsize the Tesla workforce, we have come to the decision that stopping the car is no longer a critical function,” said CEO Elon Musk, whose announcement came as a shock to the team of 500 Tesla workers responsible for the electric vehicles’ braking systems. “As the brakes never really worked anyway, we figured the team’s existence was redundant. Going forward, none of our models will be outfitted with brakes. Instead, we will shift our efforts to making fart noises louder.” At press time, Tesla staffers responsible for wheels were reportedly nervous after receiving an ominous meeting request from HR.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "New Lawsuit Alleges 'Goon Squad' Officer Tortured Black Man With Police Dog",  
    "content": "A Black man in Mississippi filed a federal lawsuit this week alleging a former officer in the high-profile and highly scrutinized Mississippi “Goon Squad” in Rankin County and several other law enforcement officers set a police dog on him while he was handcuffed on the ground in 2021, resulting in several injuries.\n\n Bobbie Adams, 41, alleged in the suit that Tony Shack, a Rankin County sheriff’s officer, unleashed his dog VooDoo on Adams after a police chase. The suit says that Christian Dedmon, an investigator with the department, falsified a report about the incident.\n\n The Rankin County Sheriff’s Office did not respond to HuffPost’s request for comment on the lawsuit.\n\n Dedmon is one of six Goon Squad officers sentenced last month by a federal judge for torturing two other Black men, Michael Jenkins and Eddie Parker. Dedmon received a 40-year prison sentence.\n\n On May 1, 2021, Adams attempted to flee deputies on foot after being caught selling methamphetamine to an informant, but he surrendered after seeing six officers on the scene in a wooded area. Officers pointed a gun at Adams while handcuffing him in a “subdued position” on the ground, according to the lawsuit.\n\n The lawsuit says that while Adams was handcuffed with several officers surrounding him, Shack ordered VooDoo to attack and bite him.\n\n “As Defendant Shack held VooDoo’s leash, the dog began to attack the handcuffed and compliant Plaintiff, biting and chewing upon the Plaintiff’s legs and feet repeatedly,” the lawsuit says.\n\n ",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "New Tinder Ad Tells Lapsed Users They Will Come Back To App Like Dog To Its Own Vomit",  
    "content": "LOS ANGELES—In a bold new campaign aimed at reversing recent declines in monthly subscribers, a new Tinder ad reportedly told lapsed users this week that they will come back to the dating app like a dog to its own vomit. “Just as a fool to their own folly, you will return to your own retchings and happily lap them up,” Tinder CEO Faye Iosotaluno said in the 30-second web and television spot, addressing former users directly as she patted her thighs and explained that it was just a matter of time before they lowered their snouts into the filth and began gorging themselves again. “Yes, I’m talking to you, you pathetic stray. You thought you were too good for us? How long did that last? Go ahead, buy the premium features, as if it will change anything. It’s like scattering a few diamonds into the warmed-over puddle of your own sickness and bile.” Sources confirmed that the ad went on to instruct users to sit for their dinner and then eat, eat like the lonely curs they were.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Nation’s White Women Announce They Have New Perspective On Paris Hilton",  
    "content": "WASHINGTON—Saying they’d learned a lot about her life and the adversities she’d faced over the years, the nation’s white women announced Monday that they had a new perspective on socialite and media personality Paris Hilton. “After many difficult, arduous hours spent reflecting on our own deeply held biases and misconceptions, as well as how the media wrongly portrayed her, we see Paris in a totally different light now,” said Cleveland resident Carly Strong, 44, who spoke on behalf of over 110 million white women across the country, adding that while back in the 2000s, they saw Hilton as a “ditsy, entitled nepo baby,” now they saw her as a strong businesswoman, role model, and mother. “Previously, we’d only really seen her on the Simple Life and other shows that depicted her as a dumb blonde who only cared about looking good and spending all her father’s money. But after reading a couple articles about her in The Cut and watching that documentary about how she got sent to an abusive reform school, we can forgive just about anything she does. Even becoming a highly paid DJ.” The nation’s white women went on to state that no matter how much they’d learned to love and respect Hilton, they still couldn’t get over how big and weird her baby’s head was.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Raven-Symoné Begs Internet Trolls To Stop Sending Death Threats To Her Wife",  
    "content": "Raven-Symoné is calling out people on the internet for apparently sending death threats to her wife, Miranda Pearman-Maday.\n\n On Thursday, the “Raven’s Home” star posted a TikTok video of her with Pearman-Maday as she called out people who have attacked her wife online after their appearance last month on the “Bottoms Up With Fannita” podcast.\n\n In that podcast episode, Pearman-Maday told host Fannita Leggett that she had faced backlash for publicly stating that she hadn’t watched the popular Disney Channel show “That’s So Raven,” which ran from 2003 to 2007, before the two met in 2015.\n\n She also later named other projects of Raven-Symoné’s that she hadn’t watched prior to meeting her now-wife.\n\n On TikTok, Raven-Symoné addressed some of the backlash, saying, “I’m here with Miranda, my wife, to tell you stop it in the comments.”\n\n “And stop with the death threats in her DMs,” she continued, calling the attacks “disrespectful” to the couple, who wed in June 2020.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Archaeological Discovery Unveils Ancient Secrets",  
    "content": "Archaeologists have made a stunning discovery, unearthing an ancient city that was once thought to be lost to history. The findings, which include well-preserved buildings and artifacts, are expected to shed light on the daily lives of the ancient civilization. The discovery has generated excitement among historians and archaeology enthusiasts worldwide.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "I Came Out As Trans At 63. People Ask Me Lots Of Questions, But There's 1 That Scares Me Most.",  
    "content": "You’ve no doubt never heard of “trans bingo,” but it became my game of choice not long after I came out as trans last spring at the age of 63. It was my way of coping with something about transition that I should’ve expected but never suspected. \n\n Since I was more often than not the first trans person that friends, family members and complete strangers had ever actually spoken to, they all had questions. Lots and lots of questions. “When did you know?” “What parts have you had either removed or added?” “What are you into now, chicks or dudes?” “Is that your real hair?” And so many more.\n\n These queries tumbled out with such regularity, it became a bit of a struggle to answer them without feeling overwhelmed and sometimes even annoyed. Then, after having dinner with a friend I hadn’t seen for years (who just kept repeating “What the fuck, dude?” throughout our meal), I came up with “trans bingo” to keep from weeping openly, when the relentless questioning left me feeling like I was being othered into a caricature. Once anyone asked me five of these routine questions in a row, I’d yell “Bingo!” — at least in my head. It helped me to take a step back, catch my breath and refocus myself.\n\n I’ve started to feel like trans people are the gender equivalent of Bitcoin: We’ve both been in the news a lot these past few years; our existence isn’t easy for people to comprehend; and people are constantly clearing their browser history so nobody will know they’ve been searching for information about us.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Tech Giant Unveils Revolutionary Product",  
    "content": "A leading tech company has unveiled a revolutionary new product that promises to change the way we interact with technology. The device, which combines cutting-edge AI with augmented reality, has been hailed as a game-changer. Consumers are eagerly awaiting its release, expecting it to transform daily activities and workflows. The product is set to launch in the coming months, with pre-orders already exceeding expectations. Analysts predict that it could disrupt multiple industries, from entertainment to healthcare, and spark a new wave of technological innovation.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Corey Feldman Recalls 'Shocking' Exchange With Barbara Walters Over Child Sex Abuse",  
    "content": "Corey Feldman still remembers Barbara Walters for dismissing his deepest secret.\n\n The “Goonies” star visited “The View” to promote his memoir “Coreyography” in 2013, in which he candidly detailed the child sexual abuse he says he endured from numerous Hollywood insiders, only for Walters to tell him: “You’re damaging an entire industry.”\n\n “It was like a knife in the heart,” Feldman told Entertainment Weekly in an interview Thursday. “It was shocking to me that somebody who I admired so much and I looked up to so much could be so deaf and just so completely wrong and off base.” ",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Shadowboxing Nation Just Rewatched ‘Rocky II’",  
    "content": "PHILADELPHIA—Triumphantly punching through the air as they dodged an imaginary foe, the shadowboxing nation confirmed this week that they had just rewatched 1979’s Rocky II. “God, the part where Rocky’s training right-handed instead of southpaw—oh, and then the chicken-chasing scene! Man, young Sly always hits just right,” said Joey Rennstadt, one of 340 million Americans who, immediately after finishing the beloved sequel, donned a red headband, threw on sweats, and started sprinting through the middle of the nearest street, making hissing sounds with each punch thrown while searching for the nearest flight of stairs to run up. “Yo, Adrian! Adrian! Yo! Adrian! I did it! Buh-nuh-nah, nah-nah-nah! Duh-na-na, na-na-na, na na!” At press time, the entire U.S. populace had been admitted to the hospital with a detached retina after an ill-conceived plan to join a prizefight.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Florida Bans Sale Of Lab-Grown Meat Citing ‘Global Elite’ Concerns",  
    "content": "In a nationwide first, Florida Gov. Ron DeSantis (R) has outlawed the sale and distribution of lab-grown meat in his state, claiming a ban will prevent “the global elite” from “forcing the world to eat lab-grown meat and insects.”\n\n “Today, Florida is fighting back against the global elite’s plan to force the world to eat meat grown in a petri dish or bugs to achieve their authoritarian goals,” DeSantis said in a statement following the legislation’s signing Wednesday.\n\n The law aims to protect the business of local cattle ranchers and farmers, which the state’s Commissioner of Agriculture, Wilton Simpson, said is under threat by alternative food options.\n\n “Lab-grown meat is a disgraceful attempt to undermine our proud traditions and prosperity, and is in direct opposition to authentic agriculture,” Simpson said.\n\n Anyone found violating the law, which goes into effect on July 1, risks being fined or having their business license suspended. Similar bans are under consideration in Alabama, Arizona and Tennessee.\n\n ",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Israel Has Briefed U.S. On Plan To Evacuate Palestinians Before Potential Rafah Operation",  
    "content": "WASHINGTON (AP) — Israel this week briefed Biden administration officials on a plan to evacuate Palestinian civilians ahead of a potential operation in the southern Gaza city of Rafah aimed at rooting out Hamas militants, according to U.S. officials familiar with the talks.\n\n The officials, who were not authorized to comment publicly and requested anonymity to speak about the sensitive exchange, said that the plan detailed by the Israelis did not change the U.S. administration’s view that moving forward with an operation in Rafah would put too many innocent Palestinian civilians at risk.\n\n Israeli Prime Minister Benjamin Netanyahu has vowed to carry out a military operation in Rafah despite warnings from President Joe Biden and other western officials that doing so would result in more civilian deaths and worsen an already dire humanitarian crisis.\n\n The Biden administration has said there could be consequences for Israel should it move forward with the operation without a credible plan to safeguard civilians.\n\n “Absent such a plan, we can’t support a major military operation going into Rafah because the damage it would do is beyond what’s acceptable,” U.S. Secretary of State Antony Blinken said late Friday at the Sedona Forum, an event in Arizona hosted by the McCain Institute.\n\n Some 1.5 million Palestinians have sheltered in the southern Gaza city as the territory has been ravaged by the war that began on Oct. 7 after Hamas militants attacked Israel, killing 1,200 people and taking about 250 hostages.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "SanDisk Introduces New Flash Wheelbarrow For Hauling 5,000 Terabytes Of Data",  
    "content": "SAN JOSE, CA—Touting it as the perfect solution for conveying enormous quantities of computer files over farmlands and dirt roads, Western Digital introduced a SanDisk flash wheelbarrow Thursday for hauling 5,000 terabytes of data. “With durable wood handles and a sturdy tire for navigating uneven terrain, the SanDisk flash wheelbarrow makes transporting heaps of data easy and pain-free,” said Western Digital CEO David Goeckeler, who noted that the USB-compatible device’s capacity was nearly 10 times that of the company’s SanDisk flash bindle. “When a memory card just won’t cut it, turn to the SanDisk flash wheelbarrow, which can hold the equivalent of 100 million songs or, alternatively, 20 billion high-resolution jpegs of cow manure.” At press time, Goeckeler confirmed that a SanDisk flash tractor was in development for hauling data servers.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Republican Praises Protest Hecklers, Including 1 Who Made Monkey Noises At Black Woman",  
    "content": "JACKSON, Miss. (AP) — Israel-Hamas war demonstrations at the University of Mississippi turned ugly this week when one counter-protester appeared to make monkey noises and gestures at a Black student in a raucous gathering that was endorsed by a far-right congressman from Georgia.\n\n “Ole Miss taking care of business,” Republican U.S. Rep. Mike Collins wrote Friday on the social platform X with a link to the video showing the racist jeers.\n\n The Associated Press left voicemail messages for Collins on Friday at his offices in Georgia and Washington and sent an email to his spokesperson, asking for an explanation of what Collins meant. There was no immediate response.\n\n The taunting brought sharp criticism on and off campus.\n\n “Students were calling for an end to genocide. They were met with racism,” James M. Thomas, a sociology professor at the University of Mississippi, wrote Friday on X.\n\nThe Rev. Cornell William Brooks, a former president and CEO of the NAACP and professor at the John F. Kennedy School of Government at Harvard University, wrote on X that a white man mocking a Black woman as a monkey “isn’t about ‘Stand With Israel’ or ‘Free Palestine.’ This is protest as performative racism.”\n\n Collins was first elected to Congress in 2022 and made several social media posts criticizing campus protests.\n\n Nobody was arrested during the demonstration Thursday at the University of Mississippi, where hecklers vastly outnumbered war protesters. According to a count by AP, more than 2,400 arrests have occurred on 46 U.S. university or college campuses since April 17 during demonstrations against the war.\n\nThe student newspaper, The Daily Mississippian, reported about 30 protesters on the Oxford campus billed themselves as UMiss for Palestine. Videos and photos from the event showed the protesters were in a grassy area near the main library, blocked off by barriers erected by campus security.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Renewable Energy Breakthrough Boosts Industry",  
    "content": "A groundbreaking discovery in renewable energy has bolstered the industry's prospects. The new technology, which enhances solar panel efficiency, has the potential to revolutionize the energy sector. Investors and environmentalists alike are optimistic about the impact it could have on reducing carbon emissions and promoting sustainable energy sources. The breakthrough comes at a critical time, as the world grapples with the effects of climate change. Governments and private companies are showing increased interest in adopting the new technology, with several pilot projects already underway. Experts predict that this innovation could be a game-changer in the global fight against climate change.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  }, 
  {  
    "title": "Pros And Cons Of Using The Passive Voice In Journalism",  
    "content": "Rather than specify that a government, army, or police officer killed civilians, many news outlets prefer merely to say that those civilians “were killed.” The Onion investigates the pros and cons of using the passive voice in journalism."  
  },  
  {  
    "title": "International Climate Change Summit Kicks Off",  
    "content": "World leaders and environmental experts have gathered for an international climate change summit, aiming to tackle the global challenge of climate change. The summit focuses on strategies for reducing greenhouse gas emissions, adapting to a changing climate, and mobilizing international cooperation. Participants are hopeful that the event will lead to meaningful actions and commitments from nations worldwide. The summit comes as the latest scientific reports warn of the dire consequences of inaction, including rising sea levels and more frequent extreme weather events. Delegates are discussing various proposals, including carbon pricing, sustainable agriculture practices, and the need for more investment in clean energy technologies." ,  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"     
  },  
  {  
    "title": "Medical Breakthrough Offers Hope for Patients",  
    "content": "A major medical breakthrough has offered new hope for patients suffering from a rare genetic disease. A novel treatment, the result of years of research, has shown promising results in clinical trials. Medical professionals and patients' families are cautiously optimistic about the potential to improve the quality of life for those affected by the condition. The treatment, which targets the underlying genetic mutation, has the potential to slow down or even reverse the progression of the disease. Researchers are now working on making the treatment more accessible and affordable, with the hope of bringing it to patients worldwide.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Space Exploration Reaches New Heights",  
    "content": "A groundbreaking space exploration mission, designed to explore the outer reaches of our solar system, has successfully launched. The mission, which includes a spacecraft equipped with advanced instruments, aims to gather valuable data on distant planets and celestial objects. Astronomers and space enthusiasts around the world are eagerly following the mission's progress. The mission is expected to last several years, with the spacecraft traveling millions of miles from Earth. Scientists hope that the data collected will help unravel the mysteries of the universe and provide insights into the origins of life. The mission is a testament to human ingenuity and the pursuit of knowledge, inspiring a new generation of explorers and scientists.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  }, 
  {  
    "title": "Hundreds Of Teenage Shoplifters Run Away With State Of Nebraska",  
    "content": "LINCOLN, NE—Warning that crime among the nation’s youth was spiraling out of control, law enforcement officials told reporters Thursday that hundreds of teenage shoplifters had gotten their hands on Nebraska and managed to run off with the entire state. “Last night, a large group of teens loitering near the Iowa border crossed into Nebraska and proceeded to steal all 49 million acres of the Cornhusker State,” said Col. John A. Bolduc, superintendent of the Nebraska State Patrol, adding that the suspects, who ranged in age from 13 to 17, had entered through Omaha and, within 30 seconds, smashed and grabbed billions of dollars’ worth of land, loaded it into their cars, and sped away. “Security footage obtained from storefronts and suburban homes shows the theft of Nebraska began at approximately 12:03 a.m. and suggests it didn’t take long for the shoplifters to fill their vehicles with every city, town, farm, and field between the Missouri River and Wyoming. In addition, the perpetrators pilfered all 2 million of our state’s residents, among them the entire membership of the Nebraska National Guard. Unfortunately, this meant there was no one to stop these delinquents as they hopped onto U.S. Route 30 and drove off with a significant percentage of America’s Great Plains.” At press time, Bolduc said authorities had located and apprehended the teenage suspects after finding a listing on Facebook Marketplace that asked $300 for a “large, mostly empty Midwestern state.”",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Teenagers Explain What It's Like Partying With Matt Gaetz",  
    "content": "The House Ethics Committee has reportedly interviewed witnesses about Rep. Matt Gaetz (R-FL) attending a house party with minors, alcohol, and illicit drugs. The Onion asked teenagers what it was like to party with Matt Gaetz, and this is what they said.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  },  
  {  
    "title": "Academy Awards Celebrate Cinematic Excellence",  
    "content": "The prestigious Academy Awards ceremony honored the best in cinematic achievements this year. AWARD WINNING ACTOR took home the award for Best Actor, while AWARD WINNING FILM won the coveted Best Picture prize. The event was a star-studded affair, with the film industry coming together to celebrate creativity and artistic expression on the silver screen.",  
    "time": "2023-10-15 08:55",
    "source":"from TheOnion"      
  }
]